OdGeBoundBlock3d.setToBoxOrtho
\details
Sets this bounding block to a coordinate-aligned box if axes of this bound block are parallel to world coordinate space axes.

OdGeBoundBlock3d.setToBoxOrtho(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this bounding block to a coordinate-aligned box if the specified axes are parallel to world coordinate space axes.
\param dir1 [in]  First coordinate system axis.
\param dir2 [in]  Second coordinate system axis.
\param dir3 [in]  Third coordinate system axis.

OdGeBoundBlock3d.center
\details
Returns the center of the bounding block.

OdGeBoundBlock3d.maxPoint
\details Gets the maximum point of the OdGeBoundBlock3d object.
\remarks
The max point of the object extents is one of two points that are used to construct a bounding block.
The max point has greater values for each coordinate axis compared to the min point.

OdGeBoundBlock3d.minPoint
\details Gets the minimum point of the OdGeBoundBlock3d object.
\remarks
The min point of the object extents is one of two points that are used to construct a bounding block.
The min point has minor values for each coordinate axis compared to the max point.

OdGeBoundBlock3d.op_Assign(OdGeBoundBlock3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details The assignment operator for the OdGeBoundBlock3d class.
\param block [in]  Input OdGeBoundBlock3d object.
\remarks
Makes this block identical to the input block.

OdGeBoundBlock3d.setToBox(System.Boolean)
\details
Sets this bounding block to a coordinate-aligned box, or a
parallelogram bounding block. Returns a reference to this
bounding block.
\param toBox [in]  If true, sets this bounding block to a
coordinate-aligned otherwise, sets it to a
parallelepiped bounding block.

OdGeBoundBlock3d.isBox
\details
Returns true if and only if this bounding block is a
coordinate-aligned box.

OdGeBoundBlock3d.isDisjoint(OdGeBoundBlock3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified bounding block
does not intersect this bounding block.
\param block [in]  Any 3D bounding block.
\param tol   [in]  Geometric tolerance.
\returns
true if the specified bounding block does not intersect this bounding block, false otherwise.

OdGeBoundBlock3d.contains(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the passed point is contained in the bounding block.
\param point [in]  Any 3D point.
\param tol   [in]  Geometric tolerance.
\returns
true if the specified point is contained in the bounding block, false otherwise.

OdGeBoundBlock3d.swell(System.Double)
\details
Moves the walls of the bounding block the specified distance.
\param distance [in]  Distance.

OdGeBoundBlock3d.extend(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Extends the bounding block to contain
the specified point.
\param point [in]  Any 3D point.

OdGeBoundBlock3d.set(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the bounding block to a parallelepiped bounding block.
\param base [in]  Base of parallelepiped bounding block.
\param side1 [in]  First side of parallelepiped bounding block.
\param side2 [in]  Second side of parallelepiped bounding block.
\param side3 [in]  Third side of parallelepiped bounding block.

OdGeBoundBlock3d.set(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the bounding block to a coordinate-aligned box.
\param p1 [in]  First point of a coordinate-aligned box.
\param p2 [in]  Second point of a coordinate-aligned box.

OdGeBoundBlock3d.get(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns base and sides of bounding block.
\param base [out]  Receives the base of the bounding box.
\param side1 [out]  Receives the first side.
\param side2 [out]  Receives the second side.
\param side3 [out]  Receives the third side.

OdGeBoundBlock3d.getMinMaxPoints(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the extents of the bounding block.
\param p1 [out]  Receives the first corner of the extents.
\param p2 [out]  Receives the second corner of the extents.

OdGeBoundBlock3d.#ctor(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for the OdGeBoundBlock3d class.
\param lcs [in]  Local coordinate system (must be orthogonal).
\param localBox [in]  Axis-aligned box in the specified lcs.

OdGeBoundBlock3d.#ctor(OdGeBoundBlock3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details Constructor for the OdGeBoundBlock3d class.
\param source [in]  Object to be cloned.
\remarks
Copies the input OdGeBoundBlock3d object.

OdGeBoundBlock3d.#ctor(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details Constructor for the OdGeBoundBlock3d class.
\param point1 [in]  First point of a coordinate-aligned box.
\param point2 [in]  Second point of a coordinate-aligned box.
\remarks
The constructor constructs a box bounded by two input points.

OdGeBoundBlock3d.#ctor(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details Constructor for the OdGeBoundBlock3d class.
\param base [in]  Base of a parallelogram bounding block.
\param side1 [in]  First side of a parallelogram bounding block.
\param side2 [in]  Second side of a parallelogram bounding block.
\param side3 [in]  Third side of a parallelogram bounding block.
\remarks
The constructor constructs a parallelogram with given point and three sides.

OdGeBoundBlock3d.#ctor
\details
The default constructor for the OdGeBoundBlock3d class. Constructs a parallelepiped reduced to the coordinate origin.
\remarks
A parallelepiped is a parallelogram extruded in an arbitrary direction.